public_html/C-C++/C++/C++ puzzles and faq.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++ puzzles and FAQ</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="C++ puzzles and FAQ"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-26T23:03+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">C++ puzzles and FAQ</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Explain the difference between templates in C++ and generics in Java.</a></li>
<li><a href="#sec-2">Differences between C++ Classes and Structs</a>
<ul>
<li><a href="#sec-2-1">members and inheritance</a></li>
<li><a href="#sec-2-2">a struct inheriting from a class and a class inheriting from a struct</a></li>
<li><a href="#sec-2-3">Inheritance differences?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Explain the difference between templates in C++ and generics in Java.</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://en.wikipedia.org/wiki/Comparison_of_Java_and_C++#Templates_vs._Generics">http://en.wikipedia.org/wiki/Comparison_of_Java_and_C%2B%2B#Templates_vs._Generics</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Differences between C++ Classes and Structs</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">members and inheritance</h3>
<div class="outline-text-3" id="text-2-1">

<p>that members of a class are private by default, whereas members of a
struct are public by default. Inheritance between classes is also
private by default, and inheritance between structs is public by
default. 
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">a struct inheriting from a class and a class inheriting from a struct</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-c"><span style="color: #98fb98;">class</span> <span style="color: #eedd82;">A</span>
{
   <span style="color: #7fffd4;">public</span>:
      <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">a</span>;
};

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">B</span> : A { };

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">C</span>
{
      <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">c</span>;
};

<span style="color: #98fb98;">class</span> <span style="color: #eedd82;">D</span> : C { };

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>()
{
   <span style="color: #98fb98;">B</span> <span style="color: #eedd82;">b</span>;
   <span style="color: #98fb98;">D</span> <span style="color: #eedd82;">d</span>;
   b.a = 1;
   d.c = 2;
}
</pre>

<p>
Although a recent version of the GNU project C++ compiler treats the
assignment of 2 into d.c in the above example as a compile-time error,
a programmer who is more interested in standards compliance should
refer to the C++ standard. After all, compilers do not determine
standard behavior; standards prescribe standard behavior for
compilers. The GNU project C++ compiler is consistent with 11.2.2 of
ISO/IEC 14882-2003, which states that the kind of inheritance is
determined by the derived class being declared as a class or struct
when an access specificer for the base class is absent.
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Inheritance differences?<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>a struct is implicitly sealed, a class isn't.
</li>
<li>a struct can't be abstract, a class can.
</li>
<li>a struct can't call : base() in its constructor whereas a class with no explicit base class can.
</li>
<li>a struct can't extend another class, a class can.
</li>
<li>a struct can't declare protected members (eg fields, nested types) a class can.
</li>
<li>a struct can't declare abstract function members, an abstract class can.
</li>
<li>a struct can't declare virtual function members, a class can.
</li>
<li>a struct can't declare sealed function members, a class can.
</li>
<li>a struct can't declare override function members, a class can. The
  one exception to this rule is that a struct can override the virtual
  methods of System.Object, viz, Equals(), and GetHashCode(), and
  ToString().
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://www.jaggersoft.com/pubs/StructsVsClasses.htm#inheritance">http://www.jaggersoft.com/pubs/StructsVsClasses.htm#inheritance</a>
differences
</p>


</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-26T23:03+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
